<a href="https://colab.research.google.com/github/mishaaggarwal15/Business_Analytics/blob/main/Data_structures.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
print("hello world")

#Numbers
#a=3 , b=5  #a and b are number objects 

#String
str1 = 'Hello Students' #string str1
str2 = ' how are you' #string str2  
str1
str2
print (str1[0:5]) #printing first five character using slice operator  
(str1[0:5])
print (str1[4]) #printing 5th character of the string  
print (str1*2) #printing the string twice  
print (str1 + str2) #printing the concatenation of str1 and str2

hello world
Hello
o
Hello StudentsHello Students
Hello Students how are you

In [3]:
#Lists
l  = [1, "hi", "python", True] 
print (l[3:])  
print (l[0:2])
print (l);  
print (l + l);  
print (l * 3);
print (type(l))
#Lets try mutation 
l[1] = "Bye"
print (l)

[True]
[1, 'hi']
[1, 'hi', 'python', True]
[1, 'hi', 'python', True, 1, 'hi', 'python', True]
[1, 'hi', 'python', True, 1, 'hi', 'python', True, 1, 'hi', 'python', True]
<class 'list'>
[1, 'Bye', 'python', True]

In [4]:
#Tuple
t  = ('hi', 'python', 2, 4) 
t 
print (t[1:]);  
print (t[0:2]);  
print (t);  
print (t + t)
print (t * 3)  
print (type(t)) 
#Lets try mutation 
t[1] = "Bye"
print (t)

('python', 2, 4)
('hi', 'python')
('hi', 'python', 2, 4)
('hi', 'python', 2, 4, 'hi', 'python', 2, 4)
('hi', 'python', 2, 4, 'hi', 'python', 2, 4, 'hi', 'python', 2, 4)
<class 'tuple'>

TypeError: ignored

In [5]:
#Dictionary
d = {1:"Jimmy", 2:'Alex', 3:'john', 4:'mike'}
d
print("1st name is "+d[1])  
print("2nd name is "+ d[4]) 
print (d); 
print (d.keys());  
print (d.values());

1st name is Jimmy
2nd name is mike
{1: 'Jimmy', 2: 'Alex', 3: 'john', 4: 'mike'}
dict_keys([1, 2, 3, 4])
dict_values(['Jimmy', 'Alex', 'john', 'mike'])

In [6]:
#----ADVANCED----
#list
#ordered collection of items; sequence of items in a list
shoplist =['apple','carrot','mango', 'banana']
shoplist
len(shoplist)
print(shoplist)

#add item to list
shoplist.append('rice')
shoplist

#sort
shoplist.sort()  #inplace sort
shoplist

#index/select
shoplist[0]
shoplist[0:4]

#delete item
del shoplist[0]
shoplist

['apple', 'carrot', 'mango', 'banana']

['banana', 'carrot', 'mango', 'rice']

In [16]:
#Tuple
#Used to hold multiple object; similar to lists; less functionality than list
#immutable - cannot modify- fast ; ( )
zoo = ('python','lion','elephant','bird')
zoo
len(zoo)
languages = 'c', 'java', 'php'  #better to put (), this also works
languages

('c', 'java', 'php')

In [8]:
#Dictionary - like an addressbook. use of associate keys with values
#key-value pairs { 'key1':value1, 'key2':value2} ; { } bracket, :colon

student = {'A101': 'Abhinav', 'A102': 'Rohit', 'A103':'Rahul', 'A104': 'Karan'}
student
student['A103']
print('Name of rollno A103 is ' +student['A103'])
del student['A104']
student
len(student)

#for rollno, name in student.items():
    #print('name of {} is {} '.format(rollno, name) )

#Lets test Mutation: 
#adding a value
student['A104'] = 'Hitesh'
student

#Set
#Sets are unordered collections of objects; ( [ , ])
teamA = set(['india','england','australia','sri lanka','ireland'])
teamA
teamB = set(['pakistan', 'south africa','bangladesh','ireland'])
teamB

#Checking whether a data value exists in a set or not.
'india' in teamA
'india' in teamB

#Adding values in a set
teamA.add('china')
teamA  #puts in order
teamA.add('india')
teamA  #no duplicates
teamA.remove('australia')
teamA

Name of rollno A103 is Rahul

{'china', 'england', 'india', 'ireland', 'sri lanka'}

In [9]:
#Create dataframe :
import pandas as pd
 
#Create a DataFrame
d = {'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
            'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
            'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
                    'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
                    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
                               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
                               'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}

d

df = pd.DataFrame(d,columns=['Name','Exam','Subject','Score'])
df

#View a column of the dataframe in pandas:
df['Name']

#View two columns of the dataframe in pandas:
df[['Name','Score','Exam']]

#View first two rows of the dataframe in pandas:
df[0:2]

    Name        Exam      Subject  Score
0  Alisa  Semester 1  Mathematics     62
1  Bobby  Semester 1  Mathematics     47